# Ultralytics 🚀 YOLO11 Small-Object Enhanced (GL-CAB + MB-FPN)

nc: 1

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# -------------------------
# BACKBONE
# -------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2
  - [-1, 1, Conv, [256, 3, 2]]             # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]      # 4 (P3)
  - [-1, 1, GL_CAB, []]                    # ADD GL-CAB on P3

  - [-1, 1, Conv, [512, 3, 2]]             # 6-P4/16
  - [-1, 2, C3k2, [512, True]]             # 7 (P4)
  - [-1, 1, GL_CAB, []]                    # ADD GL-CAB on P4
  
  - [-1, 1, Conv, [1024, 3, 2]]            # 9-P5/32
  - [-1, 2, C3k2, [1024, True]]            # 10 (P5)
  - [-1, 1, SPPF, [1024, 5]]               # 11
  - [-1, 2, C2PSA, [1024]]                 # 12

# -------------------------
# NECK (REPLACED BY MB-FPN)
# -------------------------
head:

  # MB-FPN replacing the YOLO11 PAN head
  - [[4, 7, 12], 1, MBFPN, [256]]    # inputs: P3, P4, P5

  # Detection head
  - [-1, 1, Detect, [nc]]            # Detect(P3,P4,P5)
